## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.terraform will be created
  + resource "azuread_application" "terraform" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "sgcdsops"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "824c81eb-e3f8-4ee6-8f6d-de7f50d565b7"
              + type = "Role"
            }
          + resource_access {
              + id   = "5778995a-e1bf-45b8-affa-663a9f3f4d04"
              + type = "Role"
            }
        }
    }

  # azuread_service_principal.terraform will be created
  + resource "azuread_service_principal" "terraform" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azuread_service_principal_password.terraform will be created
  + resource "azuread_service_principal_password" "terraform" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + rotate_when_changed  = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # azurerm_key_vault.state will be created
  + resource "azurerm_key_vault" "state" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "westus2"
      + name                            = "sgcdsops"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "rg-cds-ops-dev-tf-config"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tenant_id                       = "105b2061-b669-4b31-92ac-24d304d195dc"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
          + ip_rules       = [
              + "0.0.0.0/0",
            ]
        }
    }

  # azurerm_key_vault_access_policy.terraform_state_owner will be created
  + resource "azurerm_key_vault_access_policy" "terraform_state_owner" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Create",
          + "Get",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "6654addc-f7ad-4f71-be37-d19b04def508"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id          = "105b2061-b669-4b31-92ac-24d304d195dc"
    }

  # azurerm_key_vault_access_policy.terraform_state_service_principal will be created
  + resource "azurerm_key_vault_access_policy" "terraform_state_service_principal" {
      + id                 = (known after apply)
      + key_permissions    = []
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "105b2061-b669-4b31-92ac-24d304d195dc"
    }

  # azurerm_key_vault_secret.client_id will be created
  + resource "azurerm_key_vault_secret" "client_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.client_secret will be created
  + resource "azurerm_key_vault_secret" "client_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "client-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.tenant_id will be created
  + resource "azurerm_key_vault_secret" "tenant_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "tenant-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_log_analytics_workspace.state will be created
  + resource "azurerm_log_analytics_workspace" "state" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westus2"
      + name                               = "sgcdsops"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "rg-cds-ops-dev-tf-config"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # azurerm_management_lock.terraform-resource-group will be created
  + resource "azurerm_management_lock" "terraform-resource-group" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "terraform"
      + notes      = "Protects the terraform state files and key vault."
      + scope      = "/subscriptions/96a887e8-56ca-4926-ba62-33e32eeaf310/resourceGroups/rg-cds-ops-dev-tf-config"
    }

  # azurerm_monitor_diagnostic_setting.state will be created
  + resource "azurerm_monitor_diagnostic_setting" "state" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "key_vault"
      + storage_account_id             = "/subscriptions/96a887e8-56ca-4926-ba62-33e32eeaf310/resourceGroups/rg-cds-ops-dev-tf-config/providers/Microsoft.Storage/storageAccounts/sgcdsops"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + days    = 28
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # azurerm_role_assignment.storage_blob_contributor_service_principal will be created
  + resource "azurerm_role_assignment" "storage_blob_contributor_service_principal" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/96a887e8-56ca-4926-ba62-33e32eeaf310/resourceGroups/rg-cds-ops-dev-tf-config/providers/Microsoft.Storage/storageAccounts/sgcdsops"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.terraform_state_owner will be created
  + resource "azurerm_role_assignment" "terraform_state_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6654addc-f7ad-4f71-be37-d19b04def508"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/96a887e8-56ca-4926-ba62-33e32eeaf310/resourceGroups/rg-cds-ops-dev-tf-config/providers/Microsoft.Storage/storageAccounts/sgcdsops"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_container.bootstrap will be created
  + resource "azurerm_storage_container" "bootstrap" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "bootstrap"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "sgcdsops"
    }

  # time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_rfc3339 = (known after apply)
      + rotation_years   = 1
      + second           = (known after apply)
      + triggers         = {
          + "end_date" = null
          + "years"    = "1"
        }
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_id                 = (known after apply)
  + app_object_id          = (known after apply)
  + client_id              = (known after apply)
  + key_vault_id           = (known after apply)
  + key_vault_name         = "sgcdsops"
  + resource_group_name    = "rg-cds-ops-dev-tf-config"
  + sp_object_id           = (known after apply)
  + storage_account_id     = "/subscriptions/96a887e8-56ca-4926-ba62-33e32eeaf310/resourceGroups/rg-cds-ops-dev-tf-config/providers/Microsoft.Storage/storageAccounts/sgcdsops"
  + storage_account_name   = "sgcdsops"
  + subscription_id        = "96a887e8-56ca-4926-ba62-33e32eeaf310"
  + tenant_id              = "105b2061-b669-4b31-92ac-24d304d195dc"
  + tfstate_container_name = "cdsopstfstate"
```
</details>